# # 1. დაწერეთ პითონის პროგრამა, რომელიც დასაწყისში შექმნის ცარიელ სიას ([]), თუ მომხარებელი შეიყვანს სიმბოლო 'a'-ს, ნიშნავს რომ უნდა დაამატოთ სიაში რიცხვი; თუ აკრიფა 'r', სიიდან უნა წაიშალოს რიცხვი; 'e'-ს შეტანისას პროგრამამ უნდა დაასრულოს მუშაობა. მიღებული შედეგი დაბეჭდეთ კონსოლში.
# a – append; # r – remove; # e – exit - გამოიყენეთ მხოლოდ ეს ბრძანებები და მოახდინეთ სიაზე ზემოქმედება.

my_list = []

while True:
    order = input(
        "თუ გინდა სიაში დამატება შეიყვანა - a\nთუ გინდა სიიდან წაშლა შეიყვანე r\nთუ გინდა პროგრამიდან გამოსვლა შეიყვანე e: "
    ).strip()

    if order == "a":
        my_list.append(int(input("Enter number: ")))
        print("my_list =", my_list)
        print()

    elif order == "r":
        if len(my_list) == 0:
            print("სია ცარიელია!")
            print()
        else:
            remove_number = int(input("Enter number: "))
            if remove_number in my_list:
                my_list.remove(remove_number)
                print("my_list =", my_list)
                print()
            else:
                print("აღნიშნული რიცხვი არ იძებნება სიაში!")
                print()

    elif order == "e":
        print("პროგრამა დასრულებულია!")
        print()
        break
    else:
        print("არასწორი ბრძანება! შეიყვანე მითითებული რიცხვი")
        print()

# 2. დაწერეთ პითონის პროგრამა, რომელიც შექმნის სიას my_list_1 = [43, '22', 12, 66, 210, ["hi"]], და შეასრულებს შემდეგ ნაბიჯებს:
# a. დაბეჭდავს 210-ის ინდექსს; b. დაამატებს ბოლო ელემენტში ტექსტს "hello"; c. წაშლის მეორე ინდექსზე მდგომ ელემენტს და დაბეჭდავს სიას; d. შექმენით ახალი სია my_llist_2, რომელსაც ექნება my_llist_1-ის მნიშვნელობა, გაასუფთავეთ my_llist_2-ის მნიშნველობა და დაბეჭდეთ ორივე სია.მინიშნება: სიის გასუფთავება – arr.clear()

my_list_1 = [43, "22", 12, 66, 210, ["hi"]]

# a. დაბეჭდავს 210-ის ინდექსს;
print("210-ის ინდექსია:", my_list_1.index(210))
print()

# b. დაამატებს ბოლო ელემენტში ტექსტს "hello";
my_list_1.append("hello")
print("ბოლო ელემენტი დაემატა ტექსტს:", my_list_1)
print()

# c. წაშლის მეორე ინდექსზე მდგომ ელემენტს და დაბეჭდავს სიას;
del my_list_1[2]
print("მეორე ინდექსი წაშლილია:", my_list_1)
print()

# d. შექმენით ახალი სია my_list_2, რომელსაც ექნება my_list_1-ის მნიშვნელობა, გაასუფთავეთ my_list_2-ის მნიშნველობა და დაბეჭდეთ ორივე სია.მინიშნება: სიის გასუფთავება – arr.clear()
from copy import deepcopy

my_list_2 = deepcopy(my_list_1)
my_list_2.clear()
print("my_list_1 =", my_list_1)
print("my_list_2 =", my_list_2)
print()

# 3. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს ტელეფონის ნომერს და regex-ით შეამოწმებს შეყვანილი ნომერი იცავს თუ არა "(123) 456-789" ფორმატს,
# თუ იცავს დააბრუნეთ შეყვანილი ტელეფონის ნომერი, წინააღმდეგ შემთხვევაში გამოიტანეთ "Invalid format" ტექსტი. მინიშნება: სრული დამთხვევისთვის გამოიყენეთ .fullmatch() მეთოდი re მოდულიდან.

import re

pattern = r"\(\d{3}\)\s\d{3}-\d{3}"

while True:
    phone = input("შეიყვანეთ ტელეფონის ნომერი შემდეგი ფორმატით (xxx) xxx-xxx: ").strip()

    if re.fullmatch(pattern, phone):
        print("ტელეფონის ნომერი:", phone)
        break
    else:
        if phone.isalpha():
            print("გთხოვთ შეიყვანოთ მხოლოდ ციფრები დადგენილი ფორმატით")
        elif len(phone) == 0:
            print("რიცხვები არ შეგიყვანიათ")
        else:
            print("არასწორი ფორმატითაა ტელეფონის ნომერი შეყვანილი")
