# 1. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.

while True:
    n = int(input("შეიყვანეთ ნატურალური რიცხვი და გამოგითვლით მის ფაქტორიალს: "))
    if n > 0:
        total = 0
        for i in range(1, n + 1):
            total += i
        print(f"1-დან {n}-მდე რიცხვების ჯამი არის: {total}")
        break
    else:
        print("შეიყვანეთ სასურველი რიცხვი 1-ის ზევით!")

print()

# 2. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს "while" ციკლს რომ რევესრულად დაბეჭდოს რიცხვები 0-მდე. მაგალითად თუ შეიყვანს 4, დაიბეჭდოს 4, 3, 2, 1

n = int(input("შეიყვანეთ ნატურალური რიცხვი: "))

i = n
if i <= 0:
    print("გთხოვთ შეიყვანოთ ნატურალური რიცხვი")
while i > 0:
    print(i)
    i -= 1

print()

# 3. დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.


secret_number = 20

while True:
    user_input = int(input("გამოიცანი წინასწარ განსაზღვრული რიცხვი: "))

    if user_input > secret_number:
        print("შეყვანილი რიცხვი მეტია განსაზღვრულ რიცხვზე!")
    elif user_input < secret_number:
        print("შეყვანილი რიცხვი ნაკლებია განსაზღვრულ რიცხვზე")
    else:
        print(f"თქვენ გამოიცანით განსაზღვრული რიცხვი {secret_number}!")
        break

print()

# 4. დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე სანამ მომხმარებელი არ შეიყვანს 'sum' ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი.

total_sum = 0

while True:
    user_input = input(
        "შეიყვანეთ სასურველი რიცხვი (ან ჩაწერეთ 'sum' შეყვანილი რიცხვების დაჯამებისთვის): "
    )

    if user_input.lower() == "sum":
        break
    number = int(user_input)
    total_sum += number

print(f"შეყვანილი რიცხვების ჯამი არის: {total_sum}")
