# 1. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს და აბრუნებს სტრიქონის UTF-8 დაშიფრულ ვერსიას.

st_1 = input("შეიყვანე სასურველი სტრიქონი რომლის დაშიფვრაც გინდა: ")

while len(st_1) < 1:
    st_1 = input(
        "არაფერი შეგიყვანია, შეიყვანე სასურველი სტრიქონი რომლის დაშიფვრაც გინდა:"
    )

st_2 = st_1.encode("utf-8")
print(st_2)


# 2. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. ჩამოაშორეთ ზედმეტი ინტერვალები. ყველა სიმბოლო გადაიყვანეთ პატარა ასოებში და დაუმატეთ ქვესტრიქონი 'Python'. თუ შეყვანილ სტრიქონში არსებობს სიტყვა "python", ჩაანაცვლეთ "Python"-ით.

# მინიშნება: ზედმეტი ინტერვალების ჩამოსაშორებელი მეთოდია .strip(). მაგ.: "  Python is funny     ".strip()   ====>  "Python is funny"

st_3 = input("შეიყვანე სასურველი სტრიქონი: ")

while len(st_3) < 1:
    st_3 = input("არაფერი შეგიყვანია, შეიყვანე სასურველი სტრიქონი: ")

st_4 = st_3.strip().lower() + " Python"
st_5 = st_4.replace("python", "Python")
print(st_5)


# 3. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. პროგრამამ უნდა დააბრუნოს ახალი სტრიქონი, რომელიც შედგება შეყვანილი სტრიქონის პირველი ნახევრისაგან.

st_6 = input("შეიყვანე სასურველი სტრიქონი: ").strip()
while len(st_6) < 1:
    st_6 = input("არაფერი შეგიყვანია, შეიყვანე სტრიქონი: ")

print(st_6[0 : len(st_6) // 2])


# 4. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს. string მოდულის გამოყენებით დაწერეთ შემოწმება. სტრიქონი ვალიდურია მაშინ, როდესაც ის შეიცავს მინიმუმ ერთ ლათინურ ასოსა და მინიმუმ ერთ ციფრს და ამავე დროს არ შეიცავს დამატებით სიმბოლოებს: '!', '~', '#', '$' და ა.შ.

import string

st_7 = input(
    "შეიყვანე სტრიქონი, სადაც უნდა იყოს ერთი ლათინური ასო და მინიმუმ ერთი ციფრი, ზედმეტი სიმბოლოების გარეშე: "
).strip()

while len(st_7) < 1:
    st_7 = input("არაფერი შეგიყვანია, შეიყვანე სტრიქონი: ")

latin_letters = False
digits = False
invalid_symbols = False

for symbol in st_7:
    if symbol in string.ascii_letters:
        latin_letters = True
    elif symbol in string.digits:
        digits = True
    elif symbol.isalpha():
        continue
    else:
        invalid_symbols = True

if latin_letters and digits and not invalid_symbols:
    print("სტრიქონი ვალიდურია")
else:
    print("სტრიქონი არ არის ვალიდური")

# 5. დაწერეთ პითონის კოდი, რომელიც იღებს სტრიქონს, სტრიქონი გადაყავს ბაიტებში, ბეჭდავს მნიშვნელობას და შემდეგ კი გადაჰყავს ბაიტებიდან სტრიქონში და ბეჭდავს სტრიქონს.

st_8 = input("შეიყვანე სტრიქონი რომელსაც ბაიტებში გადაგიყვან: ")

while len(st_8) < 1:
    st_8 = input("არაფერი შეგიყვანია, შეიყვანე სტრიქონი: ")

bytes_version = st_8.encode("utf-8")

print("ბაიტების ვერსია:", bytes_version)

str_version = input("გინდა ბაიტების ვერსია გავიყვანო ისევ სტრიქონში [y / n]: ").lower()

if str_version == "y":
    print("სტრიქონის ვერსია:", bytes_version.decode("utf-8"))
else:
    print("პროგრამა დასრულდა, ნახვამდის")
